app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("created_at", "updated_at", "title", "room_number") VALUES (?, ?, ?, ?)  [["created_at", "2020-10-20 04:30:50.880212"], ["updated_at", "2020-10-20 04:30:50.880212"], ["title", "Code"], ["room_number", 16]]
---
    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number))
        @school_class.save